Revit 2027 API
Wall.AddAttachment Method
 Attaches the wall to the target. If an attachment already exists with the same "attachmentLocation" value, an exception is thrown. The target should be a roof, floor, ceiling, toposolid, or other wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddAttachment(
	ElementId targetId,
	AttachmentLocation attachmentLocation
)
Public Sub AddAttachment (
	targetId As ElementId,
	attachmentLocation As AttachmentLocation
)
public:
void AddAttachment(
	ElementId^ targetId,
	AttachmentLocation attachmentLocation
)
member AddAttachment :
        targetId : ElementId *
        attachmentLocation : AttachmentLocation -> unit
Parameters
targetId ElementId
 Target element id.
attachmentLocation AttachmentLocation
 The attachment location.
Exceptions
Exception | Condition
ArgumentException |  -or- wall already has an attachment to targetId.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace